# IO Tools (Text and CSV, EXCEL, HDF5, ...)

## Introduction



[Pandas online reference](http://pandas.pydata.org/pandas-docs/stable/io.html#)

Data Source: [Quandl Data](https://www.quandl.com/data/YAHOO/INDEX_DJI-DJI-Dow-Jones-Industrial-Average)

In [1]:
import pandas as pd
import numpy as np
print("Pandas version : {}".format(pd.__version__))
print("Numpy version : {}".format(np.__version__))

Pandas version : 0.22.0
Numpy version : 1.14.3

In [3]:
ll data

total 2624
-rw-r--r--@ 1 anthonyn  staff   56879 Jun  9 14:33 AAPL.csv
-rw-r--r--@ 1 anthonyn  staff   51933 Jun  9 14:33 AMZN.csv
-rw-r--r--@ 1 anthonyn  staff  209471 Jun 19 15:20 DJI_Change.csv
-rw-r--r--@ 1 anthonyn  staff   37502 Jun 10 18:35 F-F_Benchmark_Factors_Monthly.txt
-rw-r--r--@ 1 anthonyn  staff   52772 Jun  9 14:33 GLD.csv
-rw-r--r--@ 1 anthonyn  staff   57297 Jun  9 14:33 SPY.csv
-rw-r--r--@ 1 anthonyn  staff   96768 Jun 13 17:45 WHOILNYH.xls
-rw-r--r--@ 1 anthonyn  staff  655023 May  6  2016 YAHOO-INDEX_DJI.csv
-rw-r--r--@ 1 anthonyn  staff   62738 Jun 13 16:38 ^GSPC.csv
-rw-r--r--@ 1 anthonyn  staff    9440 Jun 13 17:36 heating-oil-prices-historical-chart-data.csv
-rw-r--r--@ 1 anthonyn  staff    5689 Jun 19 15:20 moderate.xlsx
-rw-r--r--@ 1 anthonyn  staff    7336 Jun 19 18:04 res.h5
-rw-r--r--@ 1 anthonyn  staff   10125 May  6  2016 sample_excel.xlsx
-rw-r--r--@ 1 anthonyn  staff      64 Jun 18 16:06 test_file.csv
-rw-r--r--@ 1 anthonyn  staff     319 Jun  3 14:48 wine.csv

## CSV

In [4]:
pd.read_csv("data/YAHOO-INDEX_DJI.csv").head()

,Date,Open,High,Low,Close,Volume,Adjusted Close
0,2016-05-05,17664.480469,17736.109375,17615.820312,17660.710938,81530000.0,17660.710938
1,2016-05-04,17735.019531,17738.060547,17609.009766,17651.259766,95020000.0,17651.259766
2,2016-05-03,17870.750000,17870.750000,17670.880859,17750.910156,97060000.0,17750.910156
3,2016-05-02,17783.779297,17912.349609,17773.710938,17891.160156,80100000.0,17891.160156
4,2016-04-29,17813.089844,17814.830078,17651.980469,17773.640625,136670000.0,17773.640625

In [8]:
pd.read_csv("data/YAHOO-INDEX_DJI.csv", index_col=0).head()

,Open,High,Low,Close,Volume,Adjusted Close
Date,,,,,,
2016-05-05,17664.480469,17736.109375,17615.820312,17660.710938,81530000.0,17660.710938
2016-05-04,17735.019531,17738.060547,17609.009766,17651.259766,95020000.0,17651.259766
2016-05-03,17870.750000,17870.750000,17670.880859,17750.910156,97060000.0,17750.910156
2016-05-02,17783.779297,17912.349609,17773.710938,17891.160156,80100000.0,17891.160156
2016-04-29,17813.089844,17814.830078,17651.980469,17773.640625,136670000.0,17773.640625

In [6]:
pd.read_csv("data/YAHOO-INDEX_DJI.csv", index_col='Date').head()

,Open,High,Low,Close,Volume,Adjusted Close
Date,,,,,,
2016-05-05,17664.480469,17736.109375,17615.820312,17660.710938,81530000.0,17660.710938
2016-05-04,17735.019531,17738.060547,17609.009766,17651.259766,95020000.0,17651.259766
2016-05-03,17870.750000,17870.750000,17670.880859,17750.910156,97060000.0,17750.910156
2016-05-02,17783.779297,17912.349609,17773.710938,17891.160156,80100000.0,17891.160156
2016-04-29,17813.089844,17814.830078,17651.980469,17773.640625,136670000.0,17773.640625

In [9]:
df = pd.read_csv("data/YAHOO-INDEX_DJI.csv", index_col='Date')
df['change'] = df["Adjusted Close"].pct_change()
df.head()

,Open,High,Low,Close,Volume,Adjusted Close,change
Date,,,,,,,
2016-05-05,17664.480469,17736.109375,17615.820312,17660.710938,81530000.0,17660.710938,NaN
2016-05-04,17735.019531,17738.060547,17609.009766,17651.259766,95020000.0,17651.259766,-0.000535
2016-05-03,17870.750000,17870.750000,17670.880859,17750.910156,97060000.0,17750.910156,0.005646
2016-05-02,17783.779297,17912.349609,17773.710938,17891.160156,80100000.0,17891.160156,0.007901
2016-04-29,17813.089844,17814.830078,17651.980469,17773.640625,136670000.0,17773.640625,-0.006569

In [10]:
df.to_csv("data/DJI_Change.csv")

## EXCEL

### Reading Excel Files
In the most basic use-case, read_excel takes a path to an Excel file, and the sheetname indicating which sheet to parse.

#### Returns a DataFrame
`read_excel('path_to_file.xls', sheetname='Sheet1')`

In [13]:
pd.read_excel("data/sample_excel.xlsx")

      Name   ICA  Exam Grade     Module
0   ALISON  0.85  0.60     B  Skydiving
1      BOB  0.52  0.63     C  Skydiving
2     JOHN  0.75  0.67     C  Skydiving
3   OLIVIA  0.84  0.80     A  Skydiving
4     TOFU  0.60  0.91     A  Skydiving
5  WILFRED  0.81  0.93     A  Skydiving

In [14]:
pd.read_excel("data/sample_excel.xlsx", sheet_name="Sheet2")

      Name   ICA  Exam Grade   Module
0  WILFRED  0.81  0.93     A  Cycling
1     TOFU  0.60  0.91     A  Cycling
2   OLIVIA  0.84  0.80     A  Cycling
3     JOHN  0.75  0.67     C  Cycling
4      BOB  0.52  0.63     C  Cycling
5   ALISON  0.85  0.60     B  Cycling

### ExcelFile class
To faciliate working with multiple sheets from the same file, the `ExcelFile` class can be used to wrap the file and can be passed into `read_excel` There will be a performance benefit for reading multiple sheets as the file is read into memory only once.

In [15]:
xlsx = pd.ExcelFile("data/sample_excel.xlsx")
df = pd.read_excel(xlsx, 'Sheet1')
df

      Name   ICA  Exam Grade     Module
0   ALISON  0.85  0.60     B  Skydiving
1      BOB  0.52  0.63     C  Skydiving
2     JOHN  0.75  0.67     C  Skydiving
3   OLIVIA  0.84  0.80     A  Skydiving
4     TOFU  0.60  0.91     A  Skydiving
5  WILFRED  0.81  0.93     A  Skydiving

In [16]:
df2 = pd.read_excel(xlsx, 'Sheet2')
df2

      Name   ICA  Exam Grade   Module
0  WILFRED  0.81  0.93     A  Cycling
1     TOFU  0.60  0.91     A  Cycling
2   OLIVIA  0.84  0.80     A  Cycling
3     JOHN  0.75  0.67     C  Cycling
4      BOB  0.52  0.63     C  Cycling
5   ALISON  0.85  0.60     B  Cycling

### Writing Excel Files to Disk
`df.to_excel('path_to_file.xlsx', sheet_name='Sheet1')`

In [17]:
df2['ICA'] = df2['ICA'] + 0.05
df2

      Name   ICA  Exam Grade   Module
0  WILFRED  0.86  0.93     A  Cycling
1     TOFU  0.65  0.91     A  Cycling
2   OLIVIA  0.89  0.80     A  Cycling
3     JOHN  0.80  0.67     C  Cycling
4      BOB  0.57  0.63     C  Cycling
5   ALISON  0.90  0.60     B  Cycling

In [18]:
df2.to_excel("data/moderate.xlsx", 'Sheet2')

In [20]:
pd.read_excel("data/moderate.xlsx", "Sheet2")

      Name   ICA  Exam Grade   Module
0  WILFRED  0.86  0.93     A  Cycling
1     TOFU  0.65  0.91     A  Cycling
2   OLIVIA  0.89  0.80     A  Cycling
3     JOHN  0.80  0.67     C  Cycling
4      BOB  0.57  0.63     C  Cycling
5   ALISON  0.90  0.60     B  Cycling

***

## HDF5 (PyTables)

In [21]:
import pandas as pd
import numpy as np
index = pd.date_range('1/1/2000', periods=8)
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])
df = pd.DataFrame(np.random.randn(8, 3), index=index,
                  columns=['A', 'B', 'C'])

In [22]:
df

                   A         B         C
2000-01-01  1.594439 -1.307028  2.129163
2000-01-02 -1.161984 -1.754743  1.643686
2000-01-03  0.044365 -0.399931  0.145398
2000-01-04 -0.808525 -0.665248 -0.718566
2000-01-05 -0.601063 -0.132647  0.109228
2000-01-06  0.849938  0.549318  0.224765
2000-01-07 -0.485072  1.495504 -1.490180
2000-01-08  0.864960 -1.422978  0.229620

In [24]:
df.to_hdf('data/res.h5', key='table')

In [25]:
pd.read_hdf('data/res.h5', key='table')

                   A         B         C
2000-01-01  1.594439 -1.307028  2.129163
2000-01-02 -1.161984 -1.754743  1.643686
2000-01-03  0.044365 -0.399931  0.145398
2000-01-04 -0.808525 -0.665248 -0.718566
2000-01-05 -0.601063 -0.132647  0.109228
2000-01-06  0.849938  0.549318  0.224765
2000-01-07 -0.485072  1.495504 -1.490180
2000-01-08  0.864960 -1.422978  0.229620

In [26]:
ll data

total 3872
-rw-r--r--@ 1 anthonyn  staff   56879 Jun  9 14:33 AAPL.csv
-rw-r--r--@ 1 anthonyn  staff   51933 Jun  9 14:33 AMZN.csv
-rw-r--r--@ 1 anthonyn  staff  850352 Jun 19 18:10 DJI_Change.csv
-rw-r--r--@ 1 anthonyn  staff   37502 Jun 10 18:35 F-F_Benchmark_Factors_Monthly.txt
-rw-r--r--@ 1 anthonyn  staff   52772 Jun  9 14:33 GLD.csv
-rw-r--r--@ 1 anthonyn  staff   57297 Jun  9 14:33 SPY.csv
-rw-r--r--@ 1 anthonyn  staff   96768 Jun 13 17:45 WHOILNYH.xls
-rw-r--r--@ 1 anthonyn  staff  655023 May  6  2016 YAHOO-INDEX_DJI.csv
-rw-r--r--@ 1 anthonyn  staff   62738 Jun 13 16:38 ^GSPC.csv
-rw-r--r--@ 1 anthonyn  staff    9440 Jun 13 17:36 heating-oil-prices-historical-chart-data.csv
-rw-r--r--@ 1 anthonyn  staff    5685 Jun 19 18:15 moderate.xlsx
-rw-r--r--@ 1 anthonyn  staff    7336 Jun 19 18:16 res.h5
-rw-r--r--@ 1 anthonyn  staff   10880 Jun 19 18:12 sample_excel.xlsx
-rw-r--r--@ 1 anthonyn  staff      64 Jun 18 16:06 test_file.csv
-rw-r--r--@ 1 anthonyn  staff     319 Jun  3 14:48 wine.csv

***